app/controllers/tutorials_controller.rb

    def create
      @tutorial = Tutorial.new(tutorial_params)
      @tutorial.user_id = current_user.id
      @tutorial.title.capitalize!
      if @tutorial.valid?
        movie = FFMPEG::Movie.new(@tutorial.video.file.file)
        @tutorial.video_duration = Time.at(movie.duration).strftime('%M:%S')
        if @tutorial.save
---
INSERT INTO "tutorials" ("category", "created_at", "description", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["category", "apple"], ["created_at", "2014-07-09 21:41:46.946193"], ["description", "a tech video"], ["title", "a new tutorial"], ["updated_at", "2014-07-09 21:41:46.946193"], ["user_id", 34]]

    def update
      if @tutorial.update_attributes(tutorial_params)
---
UPDATE "tutorials" SET "title" = $1, "updated_at" = $2 WHERE "tutorials"."id" = 21  [["title", "updated"], ["updated_at", "2014-07-09 20:55:28.216480"]]

    def destroy
      @tutorial.destroy
---
DELETE FROM "tutorials" WHERE "tutorials"."id" = $1  [["id", 23]]

    def find_tutorial
      @tutorial = Tutorial.find(params[:id])
---
SELECT  "tutorials".* FROM "tutorials"  WHERE "tutorials"."id" = $1 LIMIT 1  [["id", 23]]